{
  "backend/main.mo": "Motoko actor defining the e-commerce backend with product and order management, including CRUD operations for products (with category filtering and stock updates), order creation, and a seed function for initial data.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference for the project's frontend architecture and component responsibilities.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom property color tokens for light and dark modes, covering background, foreground, card, sidebar, chart, and destructive color roles.",
  "frontend/index.html": "Minimal HTML entry point for the Parvati Pretty Lab app, mounting the React app at #root and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Query, TanStack Router with five routes (home, catalog, product detail, checkout, order confirmation), and wrapping the app in CartProvider.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in Sheet cart drawer displaying cart items with images, quantity controls, remove buttons, subtotal, and a checkout navigation button.",
  "frontend/src/components/CategoryNavigation.tsx": "Two-column category section with image cards for Nails and Jewellery, featuring hover zoom, rose-gold gradient overlays, and links to filtered catalog pages.",
  "frontend/src/components/FeaturedProducts.tsx": "Featured products section displaying up to 4 products in a responsive grid with loading skeletons, empty state, and a View All link to the catalog.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, shop navigation links, and a WhatsApp contact link, plus a copyright line with a Caffeine.ai attribution.",
  "frontend/src/components/Header.tsx": "Sticky top header with logo, desktop/mobile navigation links, and a cart icon button that shows item count badge and opens the cart drawer.",
  "frontend/src/components/HeroSection.tsx": "Hero section displaying two side-by-side product images (nails and jewellery) with a centered overlay card containing a headline and CTA buttons linking to the catalog.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with the Header, Footer, and CartDrawer, rendering child routes via Outlet.",
  "frontend/src/components/OrderSummary.tsx": "Displays a read-only order summary panel listing cart items with images, quantities, line totals, and a final total with free shipping noted.",
  "frontend/src/components/ProductCard.tsx": "Card component for a single product showing its image, category badge, name, description, price, and an Add-to-cart button with out-of-stock handling.",
  "frontend/src/components/QuantitySelector.tsx": "Controlled increment/decrement quantity input component with configurable min/max bounds and accessible button labels.",
  "frontend/src/context/CartContext.tsx": "React context providing cart state (items, counts, subtotal, drawer open state) with localStorage persistence and BigInt serialization/deserialization for product fields.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor via React Query, using the current Internet Identity if authenticated or an anonymous actor otherwise, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication, managing login/logout state and persisting identity via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching products/orders and mutations for creating orders and seeding products via the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports fonts, sets up Tailwind directives, and defines light/dark mode CSS custom properties for the design system (rose-gold theme).",
  "frontend/src/lib/utils.ts": "Utility functions for class merging (cn), formatting prices in INR, mapping product categories to labels, and resolving product image URLs with fallback placeholders.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CatalogPage.tsx": "Product catalog page with category filter buttons (All/Nails/Jewellery) that fetches and displays products in a responsive grid with loading skeletons.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page with a validated shipping/contact form that saves orders to the backend and supports both direct order placement and WhatsApp-based ordering.",
  "frontend/src/pages/HomePage.tsx": "Home page that auto-seeds products if none exist, and renders a hero section, trust badges, featured products, category navigation, and a tagline banner.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays a post-order confirmation page showing the order reference ID, a step-by-step 'What Happens Next' timeline, a WhatsApp contact CTA, and navigation buttons to return home or continue shopping.",
  "frontend/src/pages/ProductDetailPage.tsx": "Renders a full product detail view with image, name, category badge, price, description, stock status, quantity selector, and an Add to Cart button; handles loading skeletons and not-found states.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Playfair Display, Lato), CSS-variable-based color tokens (rose-gold, cream, blush), border radii, box shadows, and fade/accordion animations.",
  "project_state.json": "Tracks the overall project state (version 15) for the Parvati Pretty Lab e-commerce site, listing existing features, architectural notes, and known issues across homepage, catalog, cart, checkout, and theming."
}